{
  "name": "MAGIC CARPET",
  "description": "#Video tutorial \r\nYoutube video-->[![IMAGE ALT TEXT HERE](https://img.youtube.com/vi/ZyTjqtlmLj4/0.jpg)](https://www.youtube.com/watch?v=ZyTjqtlmLj4) <--- click me!\r\n\r\n#Text Tutorial (A little more in depth than the video)\r\n##HUD Elements \r\nThere are two new HUD elements.\r\n\r\n-The Glide Slope Reference Line (**G-REF**): the G-REF is a line that is 3.5 degrees below the horizon and is enabled when you put the hook down.\r\n\r\n-The Ship Relative Velocity Vector(**SRVV**): is a red velocity vector that is relative to the ship (meaning that wherever you point the vector on the ship, that's where the nose gear of your plane will land). The SRVV enables when MAGIC CARPET is enabled and you **MUST** request landing on the carrier that you wish to land on in order for the SRVV to activate\r\n\r\n##Flight Control Laws\r\n-**Throttle**: The throttle no longer controls the engines. It only disables MAGIC CARPET when you go into afterburner\r\n\r\n-**Joystick**: Controlling yaw and roll is the same as normal, however moving forward and aft on the joystick no longer controls pitch (pitch is automatically controlled and kept at 5 degrees above the horizon). Moving the stick forward and aft now moves your SRVV up and down, which makes glide slope corrections simpler to make\r\n\r\n##Employment\r\n1. Put the hook down to see the Glide Slope Reference Line (G-REF) \r\n\r\n2. **Important**: Use the comms menu to request landing at the carrier you wish to land on.  This is so the Ship Relative Velocity Vector (SRVV) knows which ship to use as a reference.\r\n\r\n3. Enable MAGIC CARPET by pressing the pickle button (the button you use to switch weapons). MAGIC CARPET will only enable while your Master-Arm is off and your landing gear is down.\r\n\r\n4. Move the stick forward or aft in order to align the G-REF a little bit below the carrier's (the glide slope lights)\r\n\r\n5. Once the G-REF is aligned, move the stick forward or aft in order to align the SRVV with the G-REF\r\n\r\n6. After hitting the deck, go into afterburner or press the pickle button to disable MAGIC CARPET(**TIP**: Your SRVV should be a little bit ahead of the wires in order to catch them)\r\n\r\n##Description\r\nThis mod is based on the U.S Navy's MAGIC CARPET system for their F/A-18 super hornets. It aims to emulate the flight control laws in order to make it easier to land on the boat in VTOL.",
  "dll_file": "MAGICCARPET.dll",
  "last_edit": 637597198660520873,
  "pub_id": "r6e24mwf",
  "json_version": "",
  "version": "1.0.1",
  "tagline": "Makes landing on the carrier easier",
  "repository": "https://github.com/LSantos2003/MAGIC-CARPET",
  "is_public": true,
  "unlisted": false,
  "preview_image": "preview.png",
  "web_preview_image": "web_preview.png",
  "dependencies": [],
  "mod_dependencies": null,
  "ContentType": 1
}